{
  "translation": {
    "common": {
      "save": "Speichern",
      "apply": "Anwenden",
      "submit": "Senden",
      "clear": "Löschen",
      "cancel": "Abbrechen",
      "close": "Schließen",
      "delete": "Löschen",
      "confirm": "Bestätigen",

      "loading": "Laden...",

      "english": "Englisch",
      "german": "Deutsch",
      "french": "Französisch",

      "error": "Fehler",
      "need-cam-permissions": "Zugriff auf die Kamerarolle ist erforderlich!",
      "success": "Geschafft"
    },
    "components": {
      "DishCard": {
        "price": "Preis: {{ price }}",
        "allergens": "Allergene: {{ allergens }}",
        "disliked-ingredients": "Versteckt wegen nicht gemochter Zutaten: "
      },
      "ErrorBoundary": {
        "oops": "Hoppla!",
        "error": "Es gibt einen Fehler",
        "try-again": "Erneut versuchen"
      },
      "RestaurantCard": {
        "rating": "Bewertung: {{ rating }} ({{ ratingCount }} Bewertungen)"
      },
      "SubscriptionBox": {
        "select": "Auswählen",
        "monthly-price": "Monatlicher Preis"
      },
      "CreditCard": {
        "expire": "läuft ab am: ",
        "msg": "Sind Sie sicher, dass Sie diese Methode löschen möchten?"
      }
    },
    "pages": {
      "AboutUs": {
        "member-description-german": "4. Jahr Epitech-Student aus Deutschland",
        "member-description-french": "4. Jahr Epitech-Student aus Frankreich",
        "introduction": "Einleitung",
        "introduction-text": "Guardos ist Ihr vertrauenswürdiger Begleiter in der Welt des Essens, speziell entwickelt für Personen mit Nahrungsmittelunverträglichkeiten und spezifischen kulinarischen Vorlieben. Unsere innovative Plattform ermöglicht es Ihnen, mühelos Restaurants in Ihrer Nähe zu entdecken, die auf Ihre einzigartigen diätetischen Bedürfnisse eingehen. Egal, ob Sie glutenfrei, vegan oder andere diätetische Einschränkungen haben, Guardos sorgt dafür, dass Ihr kulinarisches Erlebnis auf Ihre Geschmacksrichtungen zugeschnitten ist. Verabschieden Sie sich von der Mühe, nach geeigneten Optionen zu suchen – mit Guardos ist es nur einen Klick entfernt, das perfekte Restaurant zu finden, das Ihren Präferenzen entspricht. Genießen Sie ein nahtloses und angenehmes kulinarisches Erlebnis mit Guardos, wo Ihre Essensauswahl stets respektiert und gefeiert wird.",
        "founding-story": "Gründungsgeschichte",
        "founding-story-text": "Unsere Reise bei Guardos begann während unserer Studienzeit, als eine vielfältige Gruppe von Personen, die jeweils mit den Herausforderungen von Nahrungsmittelunverträglichkeiten konfrontiert waren, gemeinsame Interessen fand. Ob wir mit unseren eigenen diätetischen Einschränkungen kämpften oder die Herausforderungen von Freunden und Familie beobachteten, wir erkannten die allgegenwärtige Unannehmlichkeit, geeignete Mahlzeiten zu entziffern. Belebt von dem gemeinsamen Wunsch, den Prozess der Suche nach köstlichen und maßgeschneiderten Essensmöglichkeiten zu vereinfachen, kamen wir mit einer gemeinsamen Mission zusammen: das komplexe Puzzle des gut Essen, unabhängig von den diätetischen Einschränkungen, zu lösen. So entstand Guardos, ein engagierter Versuch, Einzelpersonen in ihrem Streben nach angenehmen und problemlosen kulinarischen Erlebnissen zu unterstützen.",
        "mission-and-values": "Mission und Werte",
        "empowerment": "Ermächtigung und Inklusivität",
        "empowerment-text": "Ermöglichen Sie Einzelpersonen, informierte und inklusive Essensentscheidungen zu treffen, die ihren einzigartigen diätetischen Präferenzen und Einschränkungen entsprechen.",
        "transparency": "Transparenz und Vertrauen",
        "transparency-text": "Bieten Sie transparente und vertrauenswürdige Informationen zu Speisekarten, Zutaten und Zubereitungsmethoden von Restaurants, damit Benutzer selbstbewusste Essensentscheidungen treffen können.",
        "continuous-improvement": "Kontinuierliche Verbesserung und Innovation",
        "improvement-text": "Wir verpflichten uns zur kontinuierlichen Verbesserung, indem wir Benutzerfeedback, technologische Fortschritte und bewährte Verfahren der Branche einbeziehen, um einen kontinuierlich wertvollen Service zu bieten.",
        "team": "Team",
        "team-description": "Unsere Reise begann während unserer Studienzeit, als wir durch eine gemeinsame Leidenschaft für positive Veränderungen zusammengebracht wurden. Was uns vereint, sind nicht nur unsere akademischen Bestrebungen, sondern auch ein gemeinsames Verständnis für die Herausforderungen, die durch Nahrungsmittelunverträglichkeiten entstehen. Ob persönlich betroffen oder Zeuge der Herausforderungen von Freunden und Familie, wir erkannten die Notwendigkeit für Veränderungen. Angetrieben von Empathie und dem Wunsch, einen Beitrag zu leisten, haben wir ein Team gebildet, das sich verpflichtet hat, einen Unterschied im Leben derjenigen zu machen, die mit Nahrungsmittelunverträglichkeiten zu kämpfen haben. Unsere vielfältigen Hintergründe und Fähigkeiten vereinen sich mit einem einzigen Ziel - Lösungen zu schaffen, die die Lebensqualität für Personen mit diätetischen Einschränkungen verbessern. Gemeinsam begeben wir uns auf eine Reise, um unsere Gemeinschaft zu stärken und zu unterstützen, Idee für Idee innovativ."
      },
      "ContactUs": {
        "get-in-touch": "Kontaktieren Sie uns",
        "address": "Fasanenstraße 86, 10623 Berlin, Deutschland",
        "contact-form": "Kontaktformular",
        "name": "Name",
        "email": "E-Mail",
        "subject": "Betreff",
        "message": "Nachricht",
        "message-sent-success": "Nachricht erfolgreich gesendet!"
      },
      "FeatureRequest": {
        "name": "Name",
        "subject": "Betreff",
        "request": "Anfrage"
      },
      "UserSupport": {
        "UserSupport": "Kundensupport",
        "name": "Name",
        "subject": "Betreff",
        "issue": "Problem",
        "emailSent": "E-Mail erfolgreich gesendet!"

      },
      "MapPage": {
        "save-filter-error": "Fehler beim Speichern des Filters. Bitte versuchen Sie es erneut.",
        "save-filter-success": "Filter erfolgreich gespeichert.",
        "delete-filter-error": "Fehler beim Löschen des Filters. Bitte versuchen Sie es erneut.",
        "delete-filter-success": "Filter erfolgreich gelöscht",
        "enter-resto-name": "Restaurantname eingeben",
        "enter-city": "Stadtname eingeben",
        "search": "Suchen",
        "telephone": "Telefon: {{ phoneNumber }}",
        "website": "Website: {{ website }}",
        "menu": "Menü",
        "navigate": "Navigieren",
        "filter": "Filter",
        "rating": "Bewertung:",
        "range": "Bereich:",
        "distance": "Entfernung: {{ range }} km",
        "categories": "Kategorien:",
        "allergens": "Allergene:",
        "save-filter": "Filter speichern:",
        "enter-filter-name": "Filternamen eingeben",
        "saved-filters": "Gespeicherte Filter:",
        "load": "Laden"
      },
      "MenuPage": {
        "show-non-compatible-dishes": "Zeige inkompatible Gerichte"
      },
      "Profile": {
        "change-pw": "Passwort ändern",
        "old-pw": "Altes Passwort eingeben",
        "new-pw": "Neues Passwort eingeben",
        "wrong-pw-format": "Ihr Passwort muss mindestens 1x Großbuchstaben und Kleinbuchstaben, 1x Zahl und mindestens 7 Zeichen enthalten",
        "same-pw": "Ihr neues Passwort darf nicht Ihr altes Passwort sein",
        "confirm-pw": "Neues Passwort bestätigen",
        "no-match": "Neues Passwort und bestätigtes Passwort stimmen nicht überein.",
        "pw-changed": "Passwort erfolgreich geändert",
        "pw-changed-failure": "Fehler beim Ändern des Passworts. Bitte überprüfen Sie Ihr altes Passwort.",
        "no-token-error": "Benutzertoken nicht gefunden. Bitte melden Sie sich erneut an.",

        "username-or-email": "Benutzername oder E-Mail",
        "password": "Passwort",
        "invalid-login": "Ungültige Anmeldedaten",
        "login": "Anmelden",
        "trouble-logging-in": "Probleme beim Einloggen?",
        "register-prompt": "Sie haben noch kein Konto? Registrieren Sie sich ",
        "register-here": "hier",
        "or": "oder",
        "default": "Standard",
        "fast-food": "Fast food",
        "pizzeria": "Pizzeria",

        "logout": "Abmelden",
        "confirm-logout": "Möchten Sie sich wirklich abmelden?",
        "delete-account": "Konto löschen",
        "confirm-delete-account": "Möchten Sie Ihr Konto wirklich löschen? Diese Aktion ist nicht rückgängig zu machen.",
        "delete-account-failure-login": "Fehler beim Löschen des Kontos. Bitte melden Sie sich erneut an.",
        "delete-account-failure-retry": "Fehler beim Löschen des Kontos. Bitte versuchen Sie es erneut.",
        "profile-page": "Mein Profil",
        "changed-data-success": "Profilangaben erfolgreich geändert!",
        "changed-data-failure": "Fehler beim Ändern der Profilangaben.",
        "add-picture": "Bild hinzufügen",
        "delete-picture": "Bild löschen",
        "username": "Benutzername",
        "enter-username": "Geben Sie Ihren Benutzernamen ein",
        "email": "E-Mail",
        "enter-email": "Geben Sie Ihre E-Mail ein",
        "city": "Stadt",
        "enter-city": "Geben Sie Ihre Stadt ein",
        "apply-changes": "Änderungen übernehmen",
        "disliked-ingredients": "Vermeide folgende Zutaten",
        "ingredient-not-found": "Zutat nicht gefunden? Hier neue hinzufügen",
        "add-new-ingredient": "Neues Zutat zur Auswahl hinzufügen",
        "enter-ingredient": "Zutat eingeben",
        "fav-restos": "Lieblingsrestaurants",
        "fav-dishes": "Lieblingsgerichte",
        "previous": "Vorherige",
        "next": "Nächste",
        "feature-request": "Feature-Anfrage",
        "subscriptions": "Abonnement verwalten",
        "register": "Registrieren",
        "username-taken-or-invalid": "Der gewünschte Benutzername existiert bereits oder ist ungültig",
        "email-taken-or-invalid": "Für die angegebene E-Mail existiert bereits ein Konto oder sie ist ungültig",
        "privacy": "Datenschutzerklärung",
        "payment": "Zahlungsmethoden",
        "payBtn": "Zahlungsmethoden verwalten",
        "UserSupport": "Kundensupport",
        "terms": "Geschäftsbedingungen"
      },
      "ResetPasswordScreen": {
        "username-email-no-match": "Dieser Benutzername und diese E-Mail ({{ email }}) stimmen nicht überein. Überprüfen Sie bitte die Schreibweise oder versuchen Sie es mit einem anderen Benutzernamen.",
        "user-error": "Fehler beim Überprüfen des Benutzers. Bitte versuchen Sie es erneut.",
        "re-enter-account": "Zurück in Ihr Guardos-Konto",
        "enter-info": "Geben Sie uns einige Informationen zu Ihrem Konto",
        "enter-username-prompt": "Geben Sie als Nächstes den Guardos-Benutzernamen ein, mit dem Sie Probleme haben",
        "enter-email": "Geben Sie Ihre E-Mail-Adresse ein",
        "email": "E-Mail",
        "enter-username": "Geben Sie Ihren Benutzernamen ein",
        "username": "Benutzername",
        "email-sent": "E-Mail wurde gesendet!",
        "check-your-emails": "Bitte überprüfen Sie Ihren Posteingang auf eine E-Mail zur Passwortwiederherstellung und überprüfen Sie auch Ihren Spam-Ordner. Die E-Mail enthält einen Link, der 15 Minuten gültig bleibt.",
        "go-back": "Zurück zum Login",
        "error": "Es gab einen Fehler.",
        "try-again-msg": "Bitte versuchen Sie es erneut, um einen Wiederherstellungslink zu erhalten. Wenn der Fehler erneut auftritt, kontaktieren Sie uns bitte.",
        "continue": "Fortfahren",
        "send-reset-link": "Meinen Passwort-Wiederherstellungslink senden"
      },
      "RestaurantScreen": {
        "save-filter-error": "Fehler beim Speichern des Filters. Bitte versuchen Sie es erneut.",
        "save-filter-success": "Filter erfolgreich gespeichert",
        "delete-filter-error": "Fehler beim Löschen des Filters. Bitte versuchen Sie es erneut.",
        "delete-filter-success": "Filter erfolgreich gelöscht",
        "enter-resto-name": "Restaurantname eingeben",
        "enter-city": "Stadtname eingeben",
        "search": "Suchen",
        "filter": "Filter",
        "rating": "Bewertung: ",
        "distance": "Entfernung: ",
        "distance-details": "Entfernung: {{ distance }} km",
        "categories": "Kategorien:",
        "allergens": "Allergene:",
        "save-filter": "Filter speichern:",
        "enter-filter-name": "Filternamen eingeben",
        "saved-filters": "Gespeicherte Filter:",
        "load": "Laden",
        "noresto": "Keine passenden Restaurants gefunden. Bitte ändern Sie ihren Filter."
      },
      "Router": {
        "no-internet-error": "Keine Internetverbindung. Bitte überprüfen Sie Ihre Verbindung und versuchen Sie es erneut.",
        "resto-screen": "Restaurants",
        "map-screen": "Kartenansicht",
        "about-us": "Über uns",
        "contact-us": "Kontakt",
        "my-profile": "Mein Profil",
        "login": "Anmelden",
        "register": "Registrieren"
      },
      "SubscriptionPage": {
        "my-subscription": "Mein Abonnement",
        "free": "Kostenlose Nutzung",
        "free-description": "Nutzen Sie die Grundfunktionen kostenlos",
        "basic": "Basis Abonnement",
        "description-low-level-1": "Werbung entfernen",
        "description-low-level-2": "Gruppensuche - speichere mehrere Ernährungsprofile",
        "premium": "Premium-Abonnement",
        "description-high-level-1": "Feature-Anfragen werden priorisiert",
        "description-high-level-2": "Reservierungen vornehmen"
      },
      "Privacy": {
        "title": "Datenschutzerklärung",
        "intro": "Diese Datenschutzerklärung erläutert, wie Guardos.eu („Guardos“, „wir“, „uns“ oder „unser“) Ihre personenbezogenen Daten erhebt, verwendet und schützt, wenn Sie mit unseren Plattformen und Diensten interagieren. Wir sind bestrebt, die Privatsphäre und Sicherheit Ihrer personenbezogenen Daten gemäß der Datenschutz-Grundverordnung (DSGVO) und anderer anwendbarer Datenschutzgesetze zu gewährleisten.",
        "controller": "1. Datenverantwortlicher",
        "controllertxt": "Guardos.eu, betrieben von Guardos, ist der für die Verarbeitung Ihrer personenbezogenen Daten verantwortliche Datenverantwortliche. Wenn Sie Fragen oder Bedenken zur Verarbeitung Ihrer personenbezogenen Daten oder dieser Datenschutzerklärung haben, können Sie uns unter den am Ende dieser Erklärung angegebenen Kontaktdaten kontaktieren.",
        "types": "2. Arten von personenbezogenen Daten, die wir erfassen",
        "typestxt": "Wir erfassen und verarbeiten verschiedene Arten von personenbezogenen Daten für unterschiedliche Zwecke:",
        "type1": "Profilinformationen:",
        "type1txt": "Wenn Sie ein Konto auf Guardos.eu erstellen, erfassen wir Ihre E-Mail-Adresse, Ihren Benutzernamen und Ihr Passwort. Darüber hinaus können wir nach Ihrer bevorzugten Sprache, Allergenen, Lieblingsrestaurant und Lieblingsgerichten fragen, um Ihre Erfahrung auf unserer Plattform zu personalisieren.",
        "type2": "Kontaktinformationen:",
        "type2txt": "Wenn Sie ein Kontaktformular auf unserer Website ausfüllen, erfassen wir Ihren Namen und Ihre E-Mail-Adresse, um auf Ihre Anfragen oder Kommentare zu antworten.",
        "type3": "Zahlungsinformationen:",
        "type3txt": "Für Zahlungstransaktionen erfassen wir möglicherweise Zahlungsdetails wie Kreditkartendaten. Diese Informationen werden jedoch nicht direkt auf unseren Servern gespeichert. Wir nutzen Drittanbieter-Zahlungsabwickler, die diese Daten sicher verarbeiten.",
        "type4": "Passwortverarbeitung:",
        "type4txt": "Wenn Sie ein Konto erstellen, wird Ihr Passwort sicher verschlüsselt, bevor es übertragen und in unserer Datenbank gespeichert wird. Guardos hat keinen Zugriff auf oder speichert Klartextpasswörter. Wir setzen robuste Sicherheitsmaßnahmen ein, um Ihr Passwort zu schützen und die Integrität Ihres Kontos zu gewährleisten.",
        "purpose": "3. Zwecke der Datenverarbeitung",
        "purposetxt": "Wir verarbeiten Ihre personenbezogenen Daten für folgende Zwecke:",
        "purpose1": "Kontoverwaltung:",
        "purpose1txt": "Zur Verwaltung Ihres Kontos und Bereitstellung personalisierter Dienste basierend auf Ihren Präferenzen.",
        "purpose2": "Kundensupport:",
        "purpose2txt": "Um auf Ihre Anfragen zu antworten, Unterstützung zu leisten und etwaige Probleme oder Bedenken zu klären, die Sie haben könnten.",
        "purpose3": "Zahlungsabwicklung:",
        "purpose3txt": "Zur Abwicklung von Zahlungstransaktionen für auf Guardos.eu getätigte Bestellungen.",
        "purpose4": "Verbesserung unserer Dienstleistungen:",
        "purpose4txt": "Um das Nutzerverhalten und Feedback zu analysieren und unsere Plattform, Produkte und Dienstleistungen zu verbessern.",
        "legal": "4. Rechtsgrundlagen für die Verarbeitung",
        "legaltxt": "Die Rechtsgrundlagen für die Verarbeitung Ihrer personenbezogenen Daten können folgende sein:",
        "legal1": "Vertragliche Notwendigkeit:",
        "legal1txt": "Die Verarbeitung ist zur Erfüllung eines Vertrags mit Ihnen erforderlich (z. B. zur Bereitstellung der von Ihnen angeforderten Dienste).",
        "legal2": "Einwilligung:",
        "legal2txt": "Die Verarbeitung basiert auf Ihrer Einwilligung, die Sie jederzeit widerrufen können.",
        "legal3": "Berechtigte Interessen:",
        "legal3txt": "Die Verarbeitung ist zur Wahrung unserer berechtigten Interessen erforderlich, wie etwa zur Betrugsprävention, Sicherheit und Verbesserung unserer Dienstleistungen.",
        "data": "5. Datensicherheitsmaßnahmen",
        "datatxt": "Guardos implementiert angemessene technische und organisatorische Maßnahmen zum Schutz Ihrer personenbezogenen Daten vor unbefugtem Zugriff, Offenlegung, Änderung oder Zerstörung. Diese Maßnahmen umfassen Verschlüsselung, Zugriffskontrollen und regelmäßige Sicherheitsbewertungen.",
        "sharing": "6. Datenweitergabe",
        "sharingtxt": "Wir verkaufen oder vermieten Ihre personenbezogenen Informationen nicht an Dritte für Marketingzwecke. Wir können jedoch Ihre Informationen mit vertrauenswürdigen Drittanbieter-Dienstleistern teilen, die uns bei der Betreibung unserer Website, der Durchführung von Geschäften oder der Bedienung unterstützen. Diese Drittanbieter sind vertraglich verpflichtet, Ihre personenbezogenen Daten nur so weit wie nötig zur Bereitstellung der von Guardos angeforderten Dienste zu verwenden und Ihre Informationen zu schützen.",
        "rights": "7. Ihre Rechte",
        "rightstxt": "Sie haben bestimmte Rechte in Bezug auf Ihre personenbezogenen Daten, darunter:",
        "right1": "Recht auf Zugang:",
        "right1txt": "Sie haben das Recht, die von uns über Sie gespeicherten personenbezogenen Daten einzusehen.",
        "right2": "Recht auf Berichtigung:",
        "right2txt": "Sie haben das Recht, die Berichtigung unrichtiger oder unvollständiger personenbezogener Daten zu verlangen.",
        "right3": "Recht auf Löschung:",
        "right3txt": "Sie haben unter bestimmten Umständen das Recht, die Löschung Ihrer personenbezogenen Daten zu verlangen.",
        "right4": "Recht auf Einschränkung der Verarbeitung:",
        "right4txt": "Sie haben unter bestimmten Umständen das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.",
        "right5": "Recht auf Datenübertragbarkeit:",
        "right5txt": "Sie haben das Recht, Ihre personenbezogenen Daten in einem strukturierten, gängigen und maschinenlesbaren Format zu erhalten.",
        "right6": "Widerspruchsrecht:",
        "right6txt": "Sie haben unter bestimmten Umständen das Recht, der Verarbeitung Ihrer personenbezogenen Daten zu widersprechen, einschließlich der Verarbeitung zu Direktmarketingzwecken.",
        "right7": "Recht auf Widerruf der Einwilligung:",
        "right7txt": "Wenn die Verarbeitung auf Ihrer Einwilligung beruht, haben Sie das Recht, Ihre Einwilligung jederzeit zu widerrufen, ohne dass die Rechtmäßigkeit der aufgrund der Einwilligung vor deren Widerruf erfolgten Verarbeitung beeinträchtigt wird.",
        "rightend": "Um Ihre Rechte auszuüben oder Fragen zu Ihren personenbezogenen Daten zu stellen, kontaktieren Sie uns bitte unter den am Ende dieser Erklärung angegebenen Kontaktdaten.",
        "updates": "8. Aktualisierungen der Richtlinie",
        "updatestxt": "Guardos kann diese Datenschutzerklärung von Zeit zu Zeit aktualisieren, um Änderungen unserer Datenschutzpraktiken oder rechtlichen Anforderungen widerzuspiegeln. Wir empfehlen Ihnen, diese Erklärung regelmäßig auf die neuesten Informationen zu überprüfen.",
        "contact": "9. Kontaktieren Sie uns",
        "contacttxt": "Wenn Sie Fragen, Bedenken oder Anfragen zu dieser Datenschutzerklärung oder unseren Datenschutzpraktiken haben, kontaktieren Sie uns bitte unter:",
        "address": "Adresse: Fasanenstraße 86, 10623 Berlin, Deutschland",
        "email": "E-Mail: guardos-help@outlook.com",
        "phone": "Telefon: +49 211 1234567",
        "end": "Vielen Dank, dass Sie Guardos.eu Ihre personenbezogenen Informationen anvertrauen."
      },
      "Imprint": {
        "title": "Impressum",
        "intro": "Betreiber der Website von Guardos.eu ist",
        "us": "Guardos",
        "address1": "Fasanenstraße 86,",
        "address2": "10623 Berlin",
        "telephone": "Telefon: +49 211 1234567",
        "email": "E-Mail: guardos-help@outlook.com",
        "register": "Registergericht: ",
        "registerNr": "Handelsregisternummer: ",
        "ust": "USt.-IdNr. ",
        "manager": "Geschäftsführer: ",
        "legal": "Rechtliche Hinweise",
        "introLegal": "Die abgebildeten Marken und Logos sind eingetragene Warenzeichen von Guardos.",
        "txtlegal1": "Verbraucherinformationen gemäß Verordnung (EU) Nr. 524/2013: ",
        "txtlegal2": "Im Rahmen der Verordnung über Online-Streitbeilegung in Verbraucherangelegenheiten steht unter",
        "txtlegal3": "eine Online-Streitbeilegungsplattform der EU-Kommission zur Verfügung."
      },
      "Intro": {
        "RestoIntro": "Sehen Sie die Liste aller unserer Partner-Restaurants im restoScreen",
        "RestoInfo" : "Auf dem restoScreen können Sie nach Restaurants suchen und diese nach Entfernung, Bewertung, Kategorien und Allergenen filtern. Sie können Ihre Filter auch speichern und später wieder laden.",
        "MapIntro": "Schauen Sie sich die Restaurants in Ihrer Nähe auf dem mapScreen an",
        "MapInfo": "Im mapScreen können sie alle Restaurants in ihrer Nähe sehen und nach verschiedenen Kriterien filtern.",
        "ProfileIntro": "Verwalten Sie Ihr Profil im Profilbereich",
        "ProfileInfo": "Im Profilbereich können Sie Ihr Passwort und Ihre Profildaten ändern und Ihre Lieblingsrestaurants und -gerichte einsehen. Sie können auch Ihr Konto löschen."
      },
      "Payment": {
        "title": "Zahlungsmethoden",
        "nopay": "Es liegen keine Zahlungsmethoden vor.",
        "add": "Hinzufügen",
        "success": "Erfolg",
        "msg": "Die Zahlungsmethode wurde erfolgreich hinzugefügt",
        "error": "Error Code:"
      },
      "T&C": {
        "title": "Guardos Geschäftsbedingungen",
        "intro": "1. Einführung",
        "introTxt": "Willkommen bei Guardos! Diese Geschäftsbedingungen (\"Bedingungen\") regeln Ihre Nutzung unserer Website und mobilen Anwendung (zusammenfassend der \"Dienst\"). Durch den Zugriff auf oder die Nutzung von Guardos stimmen Sie zu, diese Bedingungen einzuhalten und an sie gebunden zu sein. Wenn Sie mit diesen Bedingungen nicht einverstanden sind, dürfen Sie unseren Dienst nicht nutzen.",
        "definitions": "2. Definitionen",
        "service": "- \"Dienst\" bezieht sich auf die Guardos-Website und die mobile Anwendung.",
        "user": "- \"Benutzer\" bezieht sich auf jede Person, die auf den Dienst zugreift oder ihn nutzt.",
        "profile": "- \"Profil\" bezieht sich auf das Benutzerkonto, das auf Guardos erstellt wurde, einschließlich persönlicher Informationen und Allergenangaben.",
        "content": "- \"Inhalt\" bezieht sich auf alle Informationen, Texte, Grafiken, Fotos und andere Materialien, die über den Dienst bereitgestellt werden.",
        "premium": "- \"Premium-Dienst\" bezieht sich auf den abonnementsbasierten Dienst, der von Guardos angeboten wird.",
        "responibilities": "3. Benutzerpflichten",
        "reg": "3.1 Kontoregistrierung",
        "regTxt": "Um bestimmte Funktionen des Dienstes nutzen zu können, müssen Sie ein Profil erstellen, indem Sie genaue und vollständige Informationen angeben. Sie sind verantwortlich für die Geheimhaltung Ihres Kontos und Passworts und für die Beschränkung des Zugriffs auf Ihr Konto.",
        "conduct": "3.2 Benutzerverhalten",
        "conductTxt": "- Sie stimmen zu, Folgendes nicht zu tun:",
        "conductOpt1": "- Den Dienst für rechtswidrige Zwecke oder in einer Weise zu nutzen, die diese Bedingungen verletzt.",
        "conductOpt2": "- Inhalte hochzuladen oder zu übertragen, die Patente, Marken, Geschäftsgeheimnisse, Urheberrechte oder andere Eigentumsrechte verletzen.",
        "conductOpt3": "- Sich an Verhaltensweisen zu beteiligen, die den Dienst schädigen oder stören oder das Nutzungserlebnis anderer Benutzer beeinträchtigen könnten.",
        "upload": "3.3 Inhalt-Uploads",
        "uploadTxt": "Durch das Hochladen oder Einreichen von Inhalten bei Guardos gewähren Sie uns eine nicht-exklusive, lizenzgebührenfreie, ewige und weltweite Lizenz zur Nutzung, Änderung, Anzeige und Verbreitung solcher Inhalte im Zusammenhang mit dem Dienst.",
        "payment": "3.4 Zahlungsmethoden",
        "paymentTxt": "Sie können Zahlungsmethoden über Stripe hinzufügen und verwalten. Durch die Nutzung von Stripe stimmen Sie zu, die Geschäftsbedingungen von Stripe einzuhalten.",
        "property": "4. Geistiges Eigentum",
        "ownership": "4.1 Eigentum",
        "ownershipTxt": "Alle Inhalte und Materialien auf dem Dienst, einschließlich Texte, Grafiken, Logos und Bilder, sind Eigentum von Guardos oder seiner Lizenzgeber und durch Urheberrechte und andere Gesetze zum Schutz des geistigen Eigentums geschützt.",
        "license": "4.2 Lizenz",
        "licenseTxt": "Guardos gewährt Ihnen eine begrenzte, nicht übertragbare und widerrufliche Lizenz, um auf den Dienst für Ihre persönliche, nicht-kommerzielle Nutzung zuzugreifen und ihn zu nutzen.",
        "restriction": "4.3 Einschränkungen",
        "restrictionTxt": "Sie dürfen keine Inhalte oder Materialien auf dem Dienst ohne unsere vorherige schriftliche Zustimmung reproduzieren, verbreiten, ändern oder abgeleitete Werke davon erstellen.",
        "privacy": "5. Datenschutz",
        "privacyTxt": "Ihre Privatsphäre ist uns wichtig. Bitte lesen Sie unsere Datenschutzerklärung, um Informationen darüber zu erhalten, wie wir Ihre persönlichen Daten erfassen, verwenden und schützen.",
        "diclaimer": "6. Haftungsausschlüsse und Haftungsbeschränkungen",
        "serviceAvailability": "6.1 Verfügbarkeit des Dienstes",
        "availabilityTxt": "Guardos garantiert nicht, dass der Dienst jederzeit verfügbar ist oder fehler- oder unterbrechungsfrei sein wird.",
        "thirdParty": "6.2 Links zu Drittanbietern",
        "thirdPartyTxt": "Der Dienst kann Links zu Websites oder Diensten Dritter enthalten. Guardos ist nicht verantwortlich für den Inhalt, die Genauigkeit oder die Praktiken dieser Drittanbieterseiten.",
        "warranty": "6.3 Keine Garantie",
        "warrantyTxt": "Der Dienst wird \"wie besehen\" und \"wie verfügbar\" bereitgestellt, ohne jegliche ausdrückliche oder stillschweigende Garantien. Guardos lehnt alle Garantien ab, einschließlich, aber nicht beschränkt auf die Genauigkeit, Zuverlässigkeit und Vollständigkeit des Dienstes.",
        "limit": "6.4 Haftungsbeschränkung",
        "limitTxt": "Guardos haftet in keinem Fall für indirekte, zufällige, besondere, Folge- oder Strafschäden oder Verluste von Gewinnen oder Einnahmen, unabhängig davon, ob sie direkt oder indirekt entstanden sind, oder für Verluste von Daten, Nutzung, Goodwill oder anderen immateriellen Verlusten, die aus (a) Ihrer Nutzung des Dienstes resultieren; (b) einem unbefugten Zugriff auf oder einer unbefugten Nutzung unserer Server und/oder persönlichen Informationen, die darin gespeichert sind.",
        "termination": "7. Kündigung",
        "right": "7.1 Kündigungsrecht",
        "rightTxt": "Guardos behält sich das Recht vor, Ihr Konto jederzeit ohne Vorankündigung zu kündigen oder zu sperren, wenn es der Meinung ist, dass Ihr Verhalten diese Bedingungen verletzt oder anderen Benutzern des Dienstes schadet.",
        "effect": "7.2 Auswirkungen der Kündigung",
        "effectTxt": "Nach der Kündigung erlischt Ihr Recht zur Nutzung des Dienstes sofort. Alle Bestimmungen dieser Bedingungen, die ihrer Natur nach die Kündigung überdauern sollten, überdauern die Kündigung, einschließlich, aber nicht beschränkt auf Eigentumsbestimmungen, Garantieausschlüsse und Haftungsbeschränkungen.",
        "law": "8. Anwendbares Recht und Streitbeilegung",
        "jurisdiction": "8.1 Gerichtsbarkeit",
        "jurisdictionTxt": "Diese Bedingungen unterliegen den Gesetzen der Bundesrepublik Deutschland und sind entsprechend auszulegen. Alle Streitigkeiten, die sich aus oder im Zusammenhang mit diesen Bedingungen oder der Nutzung des Dienstes ergeben, unterliegen der ausschließlichen Gerichtsbarkeit der Gerichte in Berlin, Deutschland.",
        "dispute": "8.2 Streitbeilegung",
        "disputeTxt": "Alle Streitigkeiten, die sich aus oder im Zusammenhang mit diesen Bedingungen oder der Nutzung des Dienstes ergeben, werden durch bindende Schiedsgerichtsbarkeit in Berlin, Deutschland, gemäß den Regeln des Deutschen Instituts für Schiedsgerichtsbarkeit (DIS) beigelegt.",
        "contact": "9. Kontaktinformationen",
        "contactTxt": "Wenn Sie Fragen oder Bedenken bezüglich dieser Bedingungen haben, kontaktieren Sie uns bitte unter:",
        "name": "Guardos",
        "address": "Adresse: Fasanenstraße 86, 10623 Berlin, Deutschland",
        "email": "E-Mail: guardos-help@outlook.com",
        "app": "10. App-spezifische Klauseln",
        "purchase": "10.1 In-App-Käufe",
        "purchaseTxt": "Restaurantbesitzer können zusätzliche Funktionen oder Dienste innerhalb der App kaufen. Alle Käufe sind endgültig und nicht erstattungsfähig, außer wenn gesetzlich vorgeschrieben.",
        "appTerms": "10.2 App-Store-Bedingungen",
        "appTermsTxt": "Ihre Nutzung der App unterliegt auch den Geschäftsbedingungen der Plattform, von der Sie die App heruntergeladen haben (z.B. Apple App Store, Google Play Store).",
        "device": "10.3 Gerätezugriff",
        "deviceTxt": "Die App kann Zugriff auf bestimmte Funktionen auf Ihrem Gerät anfordern (z.B. Ortungsdienste, Kamera), um den Dienst bereitzustellen. Sie können diese Berechtigungen über die Einstellungen Ihres Geräts verwalten.",
        "update": "11. Änderungen der Geschäftsbedingungen",
        "updateTxt": "Guardos behält sich das Recht vor, diese Bedingungen jederzeit ohne vorherige Ankündigung zu aktualisieren oder zu ändern. Ihre fortgesetzte Nutzung des Dienstes nach Änderungen stellt Ihre Zustimmung zu den neuen Bedingungen dar. Es liegt in Ihrer Verantwortung, diese Bedingungen regelmäßig auf Updates oder Änderungen zu überprüfen."
    }
    }
  }
}
