{
  "translation": {
    "common": {
      "save": "Speichern",
      "apply": "Anwenden",
      "submit": "Senden",
      "clear": "Löschen",
      "cancel": "Abbrechen",
      "close": "Schließen",
      "delete": "Löschen",

      "loading": "Laden...",

      "english": "Englisch",
      "german": "Deutsch",
      "french": "Französisch",

      "error": "Fehler",
      "need-cam-permissions": "Zugriff auf die Kamerarolle ist erforderlich!"
    },
    "components": {
      "DishCard": {
        "price": "Preis: {{ price }}",
        "allergens": "Allergene: {{ allergens }}"
      },
      "ErrorBoundary": {
        "oops": "Hoppla!",
        "error": "Es gibt einen Fehler",
        "try-again": "Erneut versuchen"
      },
      "RestaurantCard": {
        "rating": "Bewertung: {{ rating }} ({{ ratingCount }} Bewertungen)"
      }
    },
    "pages": {
      "AboutUs": {
        "member-description-german": "4. Jahr Epitech-Student aus Deutschland",
        "member-description-french": "4. Jahr Epitech-Student aus Frankreich",
        "introduction": "Einleitung",
        "introduction-text": "Guardos ist Ihr vertrauenswürdiger Begleiter in der Welt des Essens, speziell entwickelt für Personen mit Nahrungsmittelunverträglichkeiten und spezifischen kulinarischen Vorlieben. Unsere innovative Plattform ermöglicht es Ihnen, mühelos Restaurants in Ihrer Nähe zu entdecken, die auf Ihre einzigartigen diätetischen Bedürfnisse eingehen. Egal, ob Sie glutenfrei, vegan oder andere diätetische Einschränkungen haben, Guardos sorgt dafür, dass Ihr kulinarisches Erlebnis auf Ihre Geschmacksrichtungen zugeschnitten ist. Verabschieden Sie sich von der Mühe, nach geeigneten Optionen zu suchen – mit Guardos ist es nur einen Klick entfernt, das perfekte Restaurant zu finden, das Ihren Präferenzen entspricht. Genießen Sie ein nahtloses und angenehmes kulinarisches Erlebnis mit Guardos, wo Ihre Essensauswahl stets respektiert und gefeiert wird.",
        "founding-story": "Gründungsgeschichte",
        "founding-story-text": "Unsere Reise bei Guardos begann während unserer Studienzeit, als eine vielfältige Gruppe von Personen, die jeweils mit den Herausforderungen von Nahrungsmittelunverträglichkeiten konfrontiert waren, gemeinsame Interessen fand. Ob wir mit unseren eigenen diätetischen Einschränkungen kämpften oder die Herausforderungen von Freunden und Familie beobachteten, wir erkannten die allgegenwärtige Unannehmlichkeit, geeignete Mahlzeiten zu entziffern. Belebt von dem gemeinsamen Wunsch, den Prozess der Suche nach köstlichen und maßgeschneiderten Essensmöglichkeiten zu vereinfachen, kamen wir mit einer gemeinsamen Mission zusammen: das komplexe Puzzle des gut Essen, unabhängig von den diätetischen Einschränkungen, zu lösen. So entstand Guardos, ein engagierter Versuch, Einzelpersonen in ihrem Streben nach angenehmen und problemlosen kulinarischen Erlebnissen zu unterstützen.",
        "mission-and-values": "Mission und Werte",
        "empowerment": "Ermächtigung und Inklusivität",
        "empowerment-text": "Ermöglichen Sie Einzelpersonen, informierte und inklusive Essensentscheidungen zu treffen, die ihren einzigartigen diätetischen Präferenzen und Einschränkungen entsprechen.",
        "transparency": "Transparenz und Vertrauen",
        "transparency-text": "Bieten Sie transparente und vertrauenswürdige Informationen zu Speisekarten, Zutaten und Zubereitungsmethoden von Restaurants, damit Benutzer selbstbewusste Essensentscheidungen treffen können.",
        "continuous-improvement": "Kontinuierliche Verbesserung und Innovation",
        "improvement-text": "Wir verpflichten uns zur kontinuierlichen Verbesserung, indem wir Benutzerfeedback, technologische Fortschritte und bewährte Verfahren der Branche einbeziehen, um einen kontinuierlich wertvollen Service zu bieten.",
        "team": "Team",
        "team-description": "Unsere Reise begann während unserer Studienzeit, als wir durch eine gemeinsame Leidenschaft für positive Veränderungen zusammengebracht wurden. Was uns vereint, sind nicht nur unsere akademischen Bestrebungen, sondern auch ein gemeinsames Verständnis für die Herausforderungen, die durch Nahrungsmittelunverträglichkeiten entstehen. Ob persönlich betroffen oder Zeuge der Herausforderungen von Freunden und Familie, wir erkannten die Notwendigkeit für Veränderungen. Angetrieben von Empathie und dem Wunsch, einen Beitrag zu leisten, haben wir ein Team gebildet, das sich verpflichtet hat, einen Unterschied im Leben derjenigen zu machen, die mit Nahrungsmittelunverträglichkeiten zu kämpfen haben. Unsere vielfältigen Hintergründe und Fähigkeiten vereinen sich mit einem einzigen Ziel - Lösungen zu schaffen, die die Lebensqualität für Personen mit diätetischen Einschränkungen verbessern. Gemeinsam begeben wir uns auf eine Reise, um unsere Gemeinschaft zu stärken und zu unterstützen, Idee für Idee innovativ."
      },
      "ContactUs": {
        "get-in-touch": "Kontaktieren Sie uns",
        "address": "Fasanenstraße 86, 10623 Berlin, Deutschland",
        "contact-form": "Kontaktformular",
        "name": "Name",
        "email": "E-Mail",
        "subject": "Betreff",
        "message": "Nachricht",
        "message-sent-success": "Nachricht erfolgreich gesendet!"
      },
      "FeatureRequest": {
        "name": "Name",
        "subject": "Betreff",
        "request": "Anfrage"
      },
      "MapPage": {
        "save-filter-error": "Fehler beim Speichern des Filters. Bitte versuchen Sie es erneut.",
        "save-filter-success": "Filter erfolgreich gespeichert.",
        "delete-filter-error": "Fehler beim Löschen des Filters. Bitte versuchen Sie es erneut.",
        "delete-filter-success": "Filter erfolgreich gelöscht",
        "enter-resto-name": "Restaurantname eingeben",
        "enter-city": "Stadtname eingeben",
        "search": "Suchen",
        "telephone": "Telefon: {{ phoneNumber }}",
        "website": "Website: {{ website }}",
        "menu": "Menü",
        "navigate": "Navigieren",
        "filter": "Filter",
        "rating": "Bewertung:",
        "range": "Bereich:",
        "distance": "Entfernung: {{ range }} km",
        "categories": "Kategorien:",
        "allergens": "Allergene:",
        "save-filter": "Filter speichern:",
        "enter-filter-name": "Filternamen eingeben",
        "saved-filters": "Gespeicherte Filter:",
        "load": "Laden"
      },
      "Profile": {
        "change-pw": "Passwort ändern",
        "old-pw": "Altes Passwort eingeben",
        "new-pw": "Neues Passwort eingeben",
        "wrong-pw-format": "Ihr Passwort muss mindestens 1x Großbuchstaben und Kleinbuchstaben, 1x Zahl und mindestens 7 Zeichen enthalten",
        "same-pw": "Ihr neues Passwort darf nicht Ihr altes Passwort sein",
        "confirm-pw": "Neues Passwort bestätigen",
        "no-match": "Neues Passwort und bestätigtes Passwort stimmen nicht überein.",
        "pw-changed": "Passwort erfolgreich geändert",
        "pw-changed-failure": "Fehler beim Ändern des Passworts. Bitte überprüfen Sie Ihr altes Passwort.",
        "no-token-error": "Benutzertoken nicht gefunden. Bitte melden Sie sich erneut an.",

        "username-or-email": "Benutzername oder E-Mail",
        "password": "Passwort",
        "invalid-login": "Ungültige Anmeldedaten",
        "login": "Anmelden",
        "trouble-logging-in": "Probleme beim Einloggen?",
        "register-prompt": "Sie haben noch kein Konto? Registrieren Sie sich ",
        "register-here": "hier",
        "or": "oder",
        "default": "Standard",
        "fast-food": "Fast food",
        "pizzeria": "Pizzeria",

        "logout": "Abmelden",
        "confirm-logout": "Möchten Sie sich wirklich abmelden?",
        "delete-account": "Konto löschen",
        "confirm-delete-account": "Möchten Sie Ihr Konto wirklich löschen? Diese Aktion ist nicht rückgängig zu machen.",
        "delete-account-failure-login": "Fehler beim Löschen des Kontos. Bitte melden Sie sich erneut an.",
        "delete-account-failure-retry": "Fehler beim Löschen des Kontos. Bitte versuchen Sie es erneut.",
        "profile-page": "Mein Profil",
        "changed-data-success": "Profilangaben erfolgreich geändert!",
        "changed-data-failure": "Fehler beim Ändern der Profilangaben.",
        "add-picture": "Bild hinzufügen",
        "username": "Benutzername",
        "enter-username": "Geben Sie Ihren Benutzernamen ein",
        "email": "E-Mail",
        "enter-email": "Geben Sie Ihre E-Mail ein",
        "city": "Stadt",
        "enter-city": "Geben Sie Ihre Stadt ein",
        "apply-changes": "Änderungen übernehmen",
        "fav-restos": "Lieblingsrestaurants",
        "fav-dishes": "Lieblingsgerichte",
        "previous": "Vorherige",
        "next": "Nächste",
        "feature-request": "Feature-Anfrage",

        "register": "Registrieren",
        "username-taken-or-invalid": "Der gewünschte Benutzername existiert bereits oder ist ungültig",
        "email-taken-or-invalid": "Für die angegebene E-Mail existiert bereits ein Konto oder sie ist ungültig",
        "privacy": "Datenschutzerklärung"
      },
      "ResetPasswordScreen": {
        "username-email-no-match": "Dieser Benutzername und diese E-Mail ({{ email }}) stimmen nicht überein. Überprüfen Sie bitte die Schreibweise oder versuchen Sie es mit einem anderen Benutzernamen.",
        "user-error": "Fehler beim Überprüfen des Benutzers. Bitte versuchen Sie es erneut.",
        "re-enter-account": "Zurück in Ihr Guardos-Konto",
        "enter-info": "Geben Sie uns einige Informationen zu Ihrem Konto",
        "enter-username-prompt": "Geben Sie als Nächstes den Guardos-Benutzernamen ein, mit dem Sie Probleme haben",
        "enter-email": "Geben Sie Ihre E-Mail-Adresse ein",
        "email": "E-Mail",
        "enter-username": "Geben Sie Ihren Benutzernamen ein",
        "username": "Benutzername",
        "email-sent": "E-Mail wurde gesendet!",
        "check-your-emails": "Bitte überprüfen Sie Ihren Posteingang auf eine E-Mail zur Passwortwiederherstellung und überprüfen Sie auch Ihren Spam-Ordner. Die E-Mail enthält einen Link, der 15 Minuten gültig bleibt.",
        "go-back": "Zurück zum Login",
        "error": "Es gab einen Fehler.",
        "try-again-msg": "Bitte versuchen Sie es erneut, um einen Wiederherstellungslink zu erhalten. Wenn der Fehler erneut auftritt, kontaktieren Sie uns bitte.",
        "continue": "Fortfahren",
        "send-reset-link": "Meinen Passwort-Wiederherstellungslink senden"
      },
      "RestaurantScreen": {
        "save-filter-error": "Fehler beim Speichern des Filters. Bitte versuchen Sie es erneut.",
        "save-filter-success": "Filter erfolgreich gespeichert",
        "delete-filter-error": "Fehler beim Löschen des Filters. Bitte versuchen Sie es erneut.",
        "delete-filter-success": "Filter erfolgreich gelöscht",
        "enter-resto-name": "Restaurantname eingeben",
        "enter-city": "Stadtname eingeben",
        "search": "Suchen",
        "filter": "Filter",
        "rating": "Bewertung: ",
        "distance": "Entfernung: ",
        "distance-details": "Entfernung: {{ distance }} km",
        "categories": "Kategorien:",
        "allergens": "Allergene:",
        "save-filter": "Filter speichern:",
        "enter-filter-name": "Filternamen eingeben",
        "saved-filters": "Gespeicherte Filter:",
        "load": "Laden"
      },
      "Router": {
        "no-internet-error": "Keine Internetverbindung. Bitte überprüfen Sie Ihre Verbindung und versuchen Sie es erneut.",
        "resto-screen": "Restaurants",
        "map-screen": "Kartenansicht",
        "about-us": "Über uns",
        "contact-us": "Kontakt",
        "my-profile": "Mein Profil",
        "login": "Anmelden",
        "register": "Registrieren"
      },
      "Privacy": {
        "title": "Datenschutzerklärung",
        "intro": "Diese Datenschutzerklärung erläutert, wie Guardos.eu („Guardos“, „wir“, „uns“ oder „unser“) Ihre personenbezogenen Daten erhebt, verwendet und schützt, wenn Sie mit unseren Plattformen und Diensten interagieren. Wir sind bestrebt, die Privatsphäre und Sicherheit Ihrer personenbezogenen Daten gemäß der Datenschutz-Grundverordnung (DSGVO) und anderer anwendbarer Datenschutzgesetze zu gewährleisten.",
        "controller": "1. Datenverantwortlicher",
        "controllertxt": "Guardos.eu, betrieben von Guardos, ist der für die Verarbeitung Ihrer personenbezogenen Daten verantwortliche Datenverantwortliche. Wenn Sie Fragen oder Bedenken zur Verarbeitung Ihrer personenbezogenen Daten oder dieser Datenschutzerklärung haben, können Sie uns unter den am Ende dieser Erklärung angegebenen Kontaktdaten kontaktieren.",
        "types": "2. Arten von personenbezogenen Daten, die wir erfassen",
        "typestxt": "Wir erfassen und verarbeiten verschiedene Arten von personenbezogenen Daten für unterschiedliche Zwecke:",
        "type1": "Profilinformationen:",
        "type1txt": "Wenn Sie ein Konto auf Guardos.eu erstellen, erfassen wir Ihre E-Mail-Adresse, Ihren Benutzernamen und Ihr Passwort. Darüber hinaus können wir nach Ihrer bevorzugten Sprache, Allergenen, Lieblingsrestaurant und Lieblingsgerichten fragen, um Ihre Erfahrung auf unserer Plattform zu personalisieren.",
        "type2": "Kontaktinformationen:",
        "type2txt": "Wenn Sie ein Kontaktformular auf unserer Website ausfüllen, erfassen wir Ihren Namen und Ihre E-Mail-Adresse, um auf Ihre Anfragen oder Kommentare zu antworten.",
        "type3": "Zahlungsinformationen:",
        "type3txt": "Für Zahlungstransaktionen erfassen wir möglicherweise Zahlungsdetails wie Kreditkartendaten. Diese Informationen werden jedoch nicht direkt auf unseren Servern gespeichert. Wir nutzen Drittanbieter-Zahlungsabwickler, die diese Daten sicher verarbeiten.",
        "type4": "Passwortverarbeitung:",
        "type4txt": "Wenn Sie ein Konto erstellen, wird Ihr Passwort sicher verschlüsselt, bevor es übertragen und in unserer Datenbank gespeichert wird. Guardos hat keinen Zugriff auf oder speichert Klartextpasswörter. Wir setzen robuste Sicherheitsmaßnahmen ein, um Ihr Passwort zu schützen und die Integrität Ihres Kontos zu gewährleisten.",
        "purpose": "3. Zwecke der Datenverarbeitung",
        "purposetxt": "Wir verarbeiten Ihre personenbezogenen Daten für folgende Zwecke:",
        "purpose1": "Kontoverwaltung:",
        "purpose1txt": "Zur Verwaltung Ihres Kontos und Bereitstellung personalisierter Dienste basierend auf Ihren Präferenzen.",
        "purpose2": "Kundensupport:",
        "purpose2txt": "Um auf Ihre Anfragen zu antworten, Unterstützung zu leisten und etwaige Probleme oder Bedenken zu klären, die Sie haben könnten.",
        "purpose3": "Zahlungsabwicklung:",
        "purpose3txt": "Zur Abwicklung von Zahlungstransaktionen für auf Guardos.eu getätigte Bestellungen.",
        "purpose4": "Verbesserung unserer Dienstleistungen:",
        "purpose4txt": "Um das Nutzerverhalten und Feedback zu analysieren und unsere Plattform, Produkte und Dienstleistungen zu verbessern.",
        "legal": "4. Rechtsgrundlagen für die Verarbeitung",
        "legaltxt": "Die Rechtsgrundlagen für die Verarbeitung Ihrer personenbezogenen Daten können folgende sein:",
        "legal1": "Vertragliche Notwendigkeit:",
        "legal1txt": "Die Verarbeitung ist zur Erfüllung eines Vertrags mit Ihnen erforderlich (z. B. zur Bereitstellung der von Ihnen angeforderten Dienste).",
        "legal2": "Einwilligung:",
        "legal2txt": "Die Verarbeitung basiert auf Ihrer Einwilligung, die Sie jederzeit widerrufen können.",
        "legal3": "Berechtigte Interessen:",
        "legal3txt": "Die Verarbeitung ist zur Wahrung unserer berechtigten Interessen erforderlich, wie etwa zur Betrugsprävention, Sicherheit und Verbesserung unserer Dienstleistungen.",
        "data": "5. Datensicherheitsmaßnahmen",
        "datatxt": "Guardos implementiert angemessene technische und organisatorische Maßnahmen zum Schutz Ihrer personenbezogenen Daten vor unbefugtem Zugriff, Offenlegung, Änderung oder Zerstörung. Diese Maßnahmen umfassen Verschlüsselung, Zugriffskontrollen und regelmäßige Sicherheitsbewertungen.",
        "sharing": "6. Datenweitergabe",
        "sharingtxt": "Wir verkaufen oder vermieten Ihre personenbezogenen Informationen nicht an Dritte für Marketingzwecke. Wir können jedoch Ihre Informationen mit vertrauenswürdigen Drittanbieter-Dienstleistern teilen, die uns bei der Betreibung unserer Website, der Durchführung von Geschäften oder der Bedienung unterstützen. Diese Drittanbieter sind vertraglich verpflichtet, Ihre personenbezogenen Daten nur so weit wie nötig zur Bereitstellung der von Guardos angeforderten Dienste zu verwenden und Ihre Informationen zu schützen.",
        "rights": "7. Ihre Rechte",
        "rightstxt": "Sie haben bestimmte Rechte in Bezug auf Ihre personenbezogenen Daten, darunter:",
        "right1": "Recht auf Zugang:",
        "right1txt": "Sie haben das Recht, die von uns über Sie gespeicherten personenbezogenen Daten einzusehen.",
        "right2": "Recht auf Berichtigung:",
        "right2txt": "Sie haben das Recht, die Berichtigung unrichtiger oder unvollständiger personenbezogener Daten zu verlangen.",
        "right3": "Recht auf Löschung:",
        "right3txt": "Sie haben unter bestimmten Umständen das Recht, die Löschung Ihrer personenbezogenen Daten zu verlangen.",
        "right4": "Recht auf Einschränkung der Verarbeitung:",
        "right4txt": "Sie haben unter bestimmten Umständen das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.",
        "right5": "Recht auf Datenübertragbarkeit:",
        "right5txt": "Sie haben das Recht, Ihre personenbezogenen Daten in einem strukturierten, gängigen und maschinenlesbaren Format zu erhalten.",
        "right6": "Widerspruchsrecht:",
        "right6txt": "Sie haben unter bestimmten Umständen das Recht, der Verarbeitung Ihrer personenbezogenen Daten zu widersprechen, einschließlich der Verarbeitung zu Direktmarketingzwecken.",
        "right7": "Recht auf Widerruf der Einwilligung:",
        "right7txt": "Wenn die Verarbeitung auf Ihrer Einwilligung beruht, haben Sie das Recht, Ihre Einwilligung jederzeit zu widerrufen, ohne dass die Rechtmäßigkeit der aufgrund der Einwilligung vor deren Widerruf erfolgten Verarbeitung beeinträchtigt wird.",
        "rightend": "Um Ihre Rechte auszuüben oder Fragen zu Ihren personenbezogenen Daten zu stellen, kontaktieren Sie uns bitte unter den am Ende dieser Erklärung angegebenen Kontaktdaten.",
        "updates": "8. Aktualisierungen der Richtlinie",
        "updatestxt": "Guardos kann diese Datenschutzerklärung von Zeit zu Zeit aktualisieren, um Änderungen unserer Datenschutzpraktiken oder rechtlichen Anforderungen widerzuspiegeln. Wir empfehlen Ihnen, diese Erklärung regelmäßig auf die neuesten Informationen zu überprüfen.",
        "contact": "9. Kontaktieren Sie uns",
        "contacttxt": "Wenn Sie Fragen, Bedenken oder Anfragen zu dieser Datenschutzerklärung oder unseren Datenschutzpraktiken haben, kontaktieren Sie uns bitte unter:",
        "address": "Adresse: Fasanenstraße 86, 10623 Berlin, Deutschland",
        "email": "E-Mail: guardos-help@outlook.com",
        "phone": "Telefon: +49 211 1234567",
        "end": "Vielen Dank, dass Sie Guardos.eu Ihre personenbezogenen Informationen anvertrauen."
      }
    }
  }
}
