{
  "translation": {
    "common": {
      "save": "Save",
      "apply": "Apply",
      "submit": "Submit",
      "confirm": "Confirm",
      "clear": "Clear",
      "cancel": "Cancel",
      "close": "Close",
      "delete": "Delete",

      "loading": "Loading...",

      "english": "English",
      "german": "German",
      "french": "French",

      "error": "Error",
      "need-cam-permissions": "Permission to access camera roll is required!"
    },
    "components": {
      "DishCard": {
        "price": "Price: {{ price }}",
        "allergens": "Allergens: {{ allergens }}"
      },
      "ErrorBoundary": {
        "oops": "Oops!",
        "error": "There's an error",
        "try-again": "Try again"
      },
      "RestaurantCard": {
        "rating": "Rating: {{ rating }} ({{ ratingCount }} ratings)"
      },
      "CreditCard": {
        "expire": "Expires on: ",
        "msg": "Are you sure you want to delete this method?"
      }
    },
    "pages": {
      "AboutUs": {
        "member-description-german": "4th year Epitech student from Germany",
        "member-description-french": "4th year Epitech student from France",
        "introduction": "Introduction",
        "introduction-text": "Guardos is your trusted companion in the world of dining, specially crafted for individuals with food intolerances and specific culinary preferences. Our innovative platform empowers you to effortlessly discover restaurants in your vicinity \nthat cater to your unique dietary needs. Whether you're gluten-free, vegan, or have other dietary restrictions, Guardos ensures that your dining experience is tailored to your tastes. Say goodbye to the hassle of searching for suitable options – with Guardos, finding the perfect restaurant that aligns with your preferences is just a click away. Enjoy a seamless and delightful dining experience with Guardos, where your food choices are always respected and celebrated.",
        "founding-story": "Founding Story",
        "founding-story-text": "Our journey at Guardos commenced during our college days, where a diverse group of individuals, each navigating the challenges of food intolerances, found common ground. Whether grappling with our own dietary restrictions or witnessing the struggles of friends and family, we recognized the pervasive inconvenience of deciphering suitable meals. Fueled by the collective desire to simplify the process of finding delicious and tailored dining options, we came together with a shared mission: to solve the intricate puzzle of eating well, no matter the dietary constraints. Thus, Guardos was born, a dedicated effort to empower individuals in their quest for enjoyable and hassle-free dining experiences.",
        "mission-and-values": "Mission and Values",
        "empowerment": "Empowerment and Inclusivity",
        "empowerment-text": "Empower individuals to make informed and inclusive dining choices that cater to their unique dietary preferences and restrictions.",
        "transparency": "Transparency and Trust",
        "transparency-text": "Provide transparent and trustworthy information about restaurant menus, ingredients, and preparation methods to ensure users can make confident dining decisions.",
        "continuous-improvement": "Continuous Improvement and Innovation",
        "improvement-text": "Commit to ongoing improvement, incorporating user feedback, technological advancements, and industry best practices to deliver a continually valuable service.",
        "team": "Team",
        "team-description": "Our journey began during our time as students, brought together by a shared passion for making a positive impact. What unites us is not only our academic pursuits but a common understanding of the challenges posed by food intolerances. Whether personally affected or witnessing the struggles of friends and family, we recognized the need for change. Driven by empathy and a desire to contribute, we formed a team committed to making a difference in the lives of those dealing with food intolerances. Our diverse backgrounds and skills converge with a singular purpose — to create solutions that enhance the quality of life for individuals affected by dietary restrictions. Together, we embark on a journey to empower and support our community, one innovative idea at a time."
      },
      "ContactUs": {
        "get-in-touch": "Get in touch",
        "address": "Fasanenstraße 86, 10623 Berlin, Germany",
        "contact-form": "Contact Form",
        "name": "Name",
        "email": "Email",
        "subject": "Subject",
        "message": "Message",
        "message-sent-success": "Message sent successfully!"
      },
      "FeatureRequest": {
        "name": "Name",
        "subject": "Subject",
        "request": "Request"
      },
      "MapPage": {
        "save-filter-error": "Error saving filter. Please try again.",
        "save-filter-success": "Filter saved successfully.",
        "delete-filter-error": "Error deleting filter. Please try again.",
        "delete-filter-success": "Filter deleted successfully",
        "enter-resto-name": "Enter restaurant name",
        "enter-city": "Enter city name",
        "search": "Search",
        "telephone": "Telephone: {{ phoneNumber }}",
        "website": "Website: {{ website }}",
        "menu": "Menu",
        "navigate": "Navigate",
        "filter": "Filter",
        "rating": "Rating:",
        "range": "Range:",
        "distance": "Distance: {{ range }} km",
        "categories": "Categories:",
        "allergens": "Allergens:",
        "save-filter": "Save Filter:",
        "enter-filter-name": "Enter filter name",
        "saved-filters": "Saved Filters:",
        "load": "Load"
      },
      "MenuPage": {
        "show-non-compatible-dishes": "Show non-compatible dishes"
      },
      "Profile": {
        "change-pw": "Change Password",
        "old-pw": "Enter old password",
        "new-pw": "Enter new password",
        "wrong-pw-format": "Your Password should contain minimum: 1x Uppercase and Lowercase Letter, 1x Number and minimum 7 Characters",
        "same-pw": "Your new Password should not be your old password",
        "confirm-pw": "Confirm new password",
        "no-match": "New password and confirmed password do not match.",
        "pw-changed": "Password Changed successfully",
        "pw-changed-failure": "Failed to change password. Please check your old password.",
        "no-token-error": "User token not found. Please log in again.",

        "username-or-email": "Username or Email",
        "password": "Password",
        "invalid-login": "Invalid Login data",
        "login": "Login",
        "trouble-logging-in": "Trouble logging in?",
        "register-prompt": "You don't have an account yet? Register yourself ",
        "register-here": "here",
        "or": "or",
        "default": "Default",
        "fast-food": "Fast food",
        "pizzeria": "pizzeria",

        "logout": "Logout",
        "confirm-logout": "Are you sure you want to logout?",
        "delete-account": "Delete Account",
        "confirm-delete-account": "Are you sure you want to delete your account? This action is irreversible.",
        "delete-account-failure-login": "Failed to delete account. Please log in again.",
        "delete-account-failure-retry": "Failed to delete account. Please try again.",
        "profile-page": "My Profile",
        "changed-data-success": "Profile details changed successfully!",
        "changed-data-failure": "Failed to change profile details.",
        "add-picture": "Add Picture",
        "username": "Username",
        "enter-username": "Enter your username",
        "email": "Email",
        "enter-email": "Enter your email",
        "city": "City",
        "enter-city": "Enter your city",
        "apply-changes": "Apply Changes",
        "fav-restos": "Favourite Restaurants",
        "fav-dishes": "Favourite Dishes",
        "previous": "Previous",
        "next": "Next",
        "feature-request": "Feature request",

        "register": "Register",
        "username-taken-or-invalid": "The desired Username exists already or is invalid",
        "email-taken-or-invalid": "An account already exists for the specified email or is invalid",
        "privacy": "Privacy statement",
        "payment": "Payment methods",
        "payBtn": "Manage payment methods"
      },
      "ResetPasswordScreen": {
        "username-email-no-match": "That username and email ({{ email }}) don't match. Please check its spelling or try another username.",
        "user-error": "Error checking user. Please try again.",
        "re-enter-account": "Getting back into your Guardos account",
        "enter-info": "Tell us some information about your account",
        "enter-username-prompt": "Next, give us the Guardos username you're having trouble with",
        "enter-email": "Enter your email address",
        "email": "Email",
        "enter-username": "Enter your username",
        "username": "Username",
        "email-sent": "E-Mail was sent!",
        "check-your-emails": "Please check your inbox for an email regarding password recovery, and also review your spam folder. The email contains a link that will remain valid for 15 minutes.",
        "go-back": "Go back to login",
        "error": "There was an Error.",
        "try-again-msg": "Please try again to get a recovery link. If the Error appears one more time, please contact us.",
        "continue": "Continue",
        "send-reset-link": "Send My Password Reset Link"
      },
      "RestaurantScreen": {
        "save-filter-error": "Error saving filter. Please try again.",
        "save-filter-success": "Filter saved successfully",
        "delete-filter-error": "Error deleting filter. Please try again.",
        "delete-filter-success": "Filter deleted successfully",
        "enter-resto-name": "Enter restaurant name",
        "enter-city": "Enter city name",
        "search": "Search",
        "filter": "Filter",
        "rating": "Rating: ",
        "distance": "Distance: ",
        "distance-details": "Distance: {{ distance }} km",
        "categories": "Categories:",
        "allergens": "Allergens:",
        "save-filter": "Save Filter:",
        "enter-filter-name": "Enter filter name",
        "saved-filters": "Saved filters:",
        "load": "Load"
      },
      "Router": {
        "no-internet-error": "No internet connection. Please check your connection and try again.",
        "resto-screen": "Restaurant Screen",
        "map-screen": "Map Screen",
        "about-us": "About Us",
        "contact-us": "Contact Us",
        "my-profile": "My Profile",
        "login": "Login",
        "register": "Register"
      },
      "Privacy": {
        "title": "Privacy Statement",
        "intro": "This Privacy Statement explains how Guardos.eu (\"Guardos,\" \"we,\" \"us,\" or \"our\") collects, uses, and protects your personal information when you interact with our platforms and services. We are committed to ensuring the privacy and security of your personal data in accordance with the General Data Protection Regulation (GDPR) and other applicable data protection laws. ",
        "controller": "1. Data Controller",
        "controllertxt": "Guardos.eu, operated by Guardos, is the data controller responsible for the processing of your personal data. If you have any questions or concerns regarding the processing of your personal information or this Privacy Statement, you can contact us using the contact details provided at the end of this statement.",
        "types": "2. Types of Personal Data We Collect",
        "typestxt": "We collect and process various types of personal data for different purposes:",
        "type1": "Profile Information:",
        "type1txt": "When you create an account on Guardos.eu, we collect your email address, username, and password. Additionally, we may ask for your preferred language, allergens, favorite restaurant, and favorite dishes to personalize your experience on our platform.",
        "type2": "Contact Information:",
        "type2txt": "If you fill out a contact form on our website, we may collect your name and email address to respond to your inquiries or comments.",
        "type3": "Payment Information:",
        "type3txt": "For payment transactions, we may collect payment details such as credit card information. However, we do not store this information directly on our servers. We utilize third-party payment processors who handle this data securely.",
        "type4": "Password Handling:",
        "type4txt": "When you create an account, your password is securely encrypted before transmission and stored in our database. Guardos does not have access to or store plaintext passwords. We employ robust security measures to protect your password and ensure the integrity of your account.",
        "purpose": "3. Purposes of Data Processing",
        "purposetxt": "We process your personal data for the following purposes:",
        "purpose1": "Account Management:",
        "purpose1txt": "To manage your account and provide personalized services based on your preferences.",
        "purpose2": "Customer Support:",
        "purpose2txt": "To respond to your inquiries, provide assistance, and address any issues or concerns you may have.",
        "purpose3": "Payment Processing:",
        "purpose3txt": "To facilitate payment transactions for orders placed on Guardos.eu.",
        "purpose4": "Improving Our Services:",
        "purpose4txt": "To analyze user behavior and feedback in order to improve our platform, products, and services.",
        "legal": "4. Legal Basis for Processing",
        "legaltxt": "The legal bases for processing your personal data may include:",
        "legal1": "Contractual Necessity:",
        "legal1txt": "Processing is necessary for the performance of a contract with you (e.g., to provide the services you requested).",
        "legal2": "Consent:",
        "legal2txt": "Processing is based on your consent, which you may withdraw at any time.",
        "legal3": "Legitimate Interests:",
        "legal3txt": "Processing is necessary for our legitimate interests, such as fraud prevention, security, and improving our services.",
        "data": "5. Data Security Measures",
        "datatxt": "Guardos implements appropriate technical and organizational measures to safeguard your personal data against unauthorized access, disclosure, alteration, or destruction. These measures include encryption, access controls, and regular security assessments.",
        "sharing": "6. Data Sharing",
        "sharingtxt": "We do not sell or rent your personal information to third parties for marketing purposes. However, we may share your information with trusted third-party service providers who assist us in operating our website, conducting business, or servicing you. These third parties are contractually obligated to use your personal data only as necessary to provide the services requested by Guardos and to protect your information.",
        "rights": "7. Your Rights",
        "rightstxt": "You have certain rights regarding your personal data, including:",
        "right1": "Right to Access:",
        "right1txt": "You have the right to access the personal data we hold about you.",
        "right2": "Right to Rectification:",
        "right2txt": "You have the right to request correction of inaccurate or incomplete personal data.",
        "right3": "Right to Erasure:",
        "right3txt": "You have the right to request deletion of your personal data under certain circumstances.",
        "right4": "Right to Restriction of Processing:",
        "right4txt": "You have the right to request restriction of processing of your personal data under certain circumstances.",
        "right5": "Right to Data Portability:",
        "right5txt": "You have the right to receive your personal data in a structured, commonly used, and machine-readable format.",
        "right6": "Right to Object:",
        "right6txt": "You have the right to object to processing of your personal data under certain circumstances, including processing for direct marketing purposes.",
        "right7": "Right to Withdraw Consent:",
        "right7txt": " If processing is based on your consent, you have the right to withdraw your consent at any time without affecting the lawfulness of processing based on consent before its withdrawal.",
        "rightend": "To exercise your rights or for any inquiries regarding your personal data, please contact us using the contact information provided at the end of this statement.",
        "updates": "8. Policy Updates",
        "updatestxt": "Guardos may update this Privacy Statement from time to time to reflect changes in our privacy practices or legal requirements. We encourage you to review this statement periodically for the latest information.",
        "contact": "9. Contact Us",
        "contacttxt": "If you have any questions, concerns, or requests regarding this Privacy Statement or our privacy practices, please contact us at:",
        "address": "Address: Fasanenstraße 86, 10623 Berlin, Germany",
        "email": "Email: guardos-help@outlook.com",
        "phone": "Phone: +49 211 1234567",
        "end": "Thank you for entrusting Guardos.eu with your personal information."
      },
      "Imprint": {
        "title": "Imprint",
        "intro": "Operator of the website Guardos.eu is",
        "us": "Guardos",
        "address1": "Fasanenstraße 86,",
        "address2": "10623 Berlin",
        "telephone": "Telephone: +49 211 1234567",
        "email": "Email: guardos-help@outlook.com",
        "register": "Registry court: ",
        "registerNr": "Commercial register number: ",
        "ust": "VAT ID: ",
        "manager": "Managing Director: ",
        "legal": "Legal Notice",
        "introLegal": "The depicted trademarks and logos are registered trademarks of Guardos.",
        "txtlegal1": "Consumer information according to Regulation (EU) No. 524/2013: ",
        "txtlegal2": "An online dispute resolution platform of the EU Commission is available at",
        "txtlegal3": ", within the framework of the regulation on online dispute resolution in consumer matters."
      },
      "Payment": {
        "title": "Payment methods",
        "nopay": "No payment methods added.",
        "add": "Add payment",
        "success": "Success",
        "msg": "The payment method was added successfully",
        "error": "Error code:"
      }
    }
  }
}
